import type { IDeliveryZone } from '../../widgets/Map/ui/MapWidget/MapWidget.types';

export const DELIVERY_ZONES: IDeliveryZone[] = [
  {
  id: '1',
  name: 'Северо-Запад',
  status: 'active',
  coordinates: [
    [
      [37.42, 55.88],
      [37.50, 55.91],
      [37.63, 55.89],
      [37.69, 55.84],
      [37.64, 55.77],
      [37.52, 55.75],
      [37.43, 55.80],
      [37.42, 55.88],
    ],
  ],
},
  {
  id: '2',
  name: 'Северо-Восток',
  status: 'stopped',
  coordinates: [
    [
      [37.63, 55.89],
      [37.78, 55.91],
      [37.90, 55.86],
      [37.92, 55.78],
      [37.83, 55.73],
      [37.70, 55.75],
      [37.64, 55.80],
      [37.63, 55.89],
    ],
  ],
},
  {
  id: '3',
  name: 'Юго-Восток',
  status: 'active',
  coordinates: [
    [
      [37.60, 55.72],
      [37.74, 55.73],
      [37.88, 55.69],
      [37.93, 55.61],
      [37.84, 55.56],
      [37.69, 55.57],
      [37.58, 55.63],
      [37.60, 55.72],
    ],
  ],
},
];